majors = [
    {
        "value": "0194002",
        "name": "기계공학과 / 기계공학"
    },
    {
        "value": "0198005",
        "name": "항공우주공학과 / 항공우주공학"
    },
    {
        "value": "1013446",
        "name": "조선해양공학과 / 조선해양공학"
    },
    {
        "value": "1014514",
        "name": "산업경영공학과 / 산업경영공학"
    },
    {
        "value": "1235021",
        "name": "화학공학과 / 화학공학"
    },
    {
        "value": "1235756",
        "name": "화학공학과 / 이차전지공학"
    },
    {
        "value": "0223022",
        "name": "고분자공학과 / 고분자공학"
    },
    {
        "value": "1016386",
        "name": "신소재공학과 / 신소재공학"
    },
    {
        "value": "1016757",
        "name": "신소재공학과 / 반도체공학"
    },
    {
        "value": "1017516",
        "name": "사회인프라공학과 / 사회인프라공학"
    },
    {
        "value": "0225028",
        "name": "환경공학과 / 환경공학"
    },
    {
        "value": "1104537",
        "name": "공간정보공학과 / 공간정보공학"
    },
    {
        "value": "0691156",
        "name": "건축학부 / 건축공학"
    },
    {
        "value": "0691305",
        "name": "건축학부 / 건축학"
    },
    {
        "value": "0930430",
        "name": "에너지자원공학과 / 에너지자원공학"
    },
    {
        "value": "0208014",
        "name": "전기공학과 / 전기공학"
    },
    {
        "value": "0209015",
        "name": "전자공학과 / 전자공학"
    },
    {
        "value": "1185283",
        "name": "정보통신공학과 / 정보통신공학"
    },
    {
        "value": "1185767",
        "name": "정보통신공학과 / 인공지능반도체공학"
    },
    {
        "value": "1443732",
        "name": "공과대학(FVE) / 미래자동차공학"
    },
    {
        "value": "1565770",
        "name": "반도체시스템공학과 / 반도체시스템공학"
    },
    {
        "value": "1063157",
        "name": "수학과 / 수학"
    },
    {
        "value": "1064040",
        "name": "통계학과 / 통계학"
    },
    {
        "value": "1065039",
        "name": "물리학과 / 물리학"
    },
    {
        "value": "1066041",
        "name": "화학과 / 화학"
    },
    {
        "value": "1023307",
        "name": "해양과학과 / 해양과학"
    },
    {
        "value": "1186074",
        "name": "식품영양학과 / 식품영양학"
    },
    {
        "value": "0333045",
        "name": "경영학과 / 경영학"
    },
    {
        "value": "1025431",
        "name": "글로벌금융학과 / 글로벌금융학"
    },
    {
        "value": "0934339",
        "name": "아태물류학부 / 물류학"
    },
    {
        "value": "1187268",
        "name": "국제통상학과 / 국제통상학"
    },
    {
        "value": "0267059",
        "name": "국어교육과 / 국어교육"
    },
    {
        "value": "0268065",
        "name": "영어교육과 / 영어교육"
    },
    {
        "value": "0275054",
        "name": "사회교육과 / 사회교육"
    },
    {
        "value": "0273057",
        "name": "체육교육과 / 체육교육"
    },
    {
        "value": "0276055",
        "name": "교육학과 / 교육학"
    },
    {
        "value": "0749160",
        "name": "수학교육과 / 수학교육"
    },
    {
        "value": "0478051",
        "name": "행정학과 / 행정학"
    },
    {
        "value": "0477053",
        "name": "정치외교학과 / 정치외교학"
    },
    {
        "value": "0477774",
        "name": "정치외교학과 / 기후위기대응"
    },
    {
        "value": "1188047",
        "name": "경제학과 / 경제학"
    },
    {
        "value": "1189364",
        "name": "소비자학과 / 소비자학"
    },
    {
        "value": "1190557",
        "name": "아동심리학과 / 아동심리학"
    },
    {
        "value": "1191555",
        "name": "사회복지학과 / 사회복지학"
    },
    {
        "value": "1343693",
        "name": "미디어커뮤니케이션학과 / 미디어커뮤니케이션학"
    },
    {
        "value": "1026369",
        "name": "한국어문학과 / 한국어문학"
    },
    {
        "value": "0301071",
        "name": "사학과 / 사학"
    },
    {
        "value": "0302072",
        "name": "철학과 / 철학"
    },
    {
        "value": "1192556",
        "name": "중국학과 / 중국학"
    },
    {
        "value": "1028485",
        "name": "일본언어문화학과 / 일본언어문화"
    },
    {
        "value": "0294067",
        "name": "영어영문학과 / 영어영문학"
    },
    {
        "value": "1029486",
        "name": "프랑스언어문화학과 / 프랑스언어문화"
    },
    {
        "value": "1236588",
        "name": "문화콘텐츠문화경영학과 / 문화콘텐츠문화경영학"
    },
    {
        "value": "0317077",
        "name": "의예과 / 의예"
    },
    {
        "value": "0321079",
        "name": "간호학과 / 간호학"
    },
    {
        "value": "0318078",
        "name": "의학과 / 의학"
    },
    {
        "value": "1238590",
        "name": "소프트웨어융합공학과 / 소프트웨어융합공학"
    },
    {
        "value": "1239591",
        "name": "산업경영학과 / 산업경영학"
    },
    {
        "value": "1262600",
        "name": "메카트로닉스공학과 / 메카트로닉스공학"
    },
    {
        "value": "1263601",
        "name": "금융투자학과 / 금융투자학"
    },
    {
        "value": "1564769",
        "name": "반도체산업융합학과 / 반도체산업융합"
    },
    {
        "value": "1207569",
        "name": "프런티어학부대학 / 프런티어학부대학"
    },
    {
        "value": "1519763",
        "name": "자유전공학부 / 자유전공학부"
    },
    {
        "value": "1393686",
        "name": "IBT학과 / 국제경영학"
    },
    {
        "value": "1394687",
        "name": "ISE학과 / 융합시스템공학"
    },
    {
        "value": "1395695",
        "name": "KLC학과 / 국제한국언어문화학"
    },
    {
        "value": "1430217",
        "name": "컴퓨터공학과 / 컴퓨터공학"
    },
    {
        "value": "1389722",
        "name": "인공지능공학과 / 인공지능공학"
    },
    {
        "value": "1390723",
        "name": "데이터사이언스학과 / 데이터사이언스학"
    },
    {
        "value": "1391724",
        "name": "스마트모빌리티공학과 / 스마트모빌리티공학"
    },
    {
        "value": "1392725",
        "name": "디자인테크놀로지학과 / 디자인테크놀로지학"
    },
    {
        "value": "1223583",
        "name": "소프트웨어융합대학(SCSC) / 연계전공(SCSC)"
    },
    {
        "value": "1449558",
        "name": "조형예술학과 / 조형예술학"
    },
    {
        "value": "1450589",
        "name": "디자인융합학과 / 디자인융합학"
    },
    {
        "value": "1452519",
        "name": "스포츠과학과 / 스포츠과학"
    },
    {
        "value": "1453372",
        "name": "연극영화학과 / 연극영화학"
    },
    {
        "value": "1454288",
        "name": "의류디자인학과 / 의류디자인학"
    },
    {
        "value": "1581304",
        "name": "생명공학과 / 생명공학"
    },
    {
        "value": "1582306",
        "name": "생명과학과 / 생명과학"
    },
    {
        "value": "1583737",
        "name": "바이오제약공학과 / 바이오제약공학"
    }
]